/*****************************************************************************
weaponFactory.cpp
Aythor	: 上野　匠
Data	: 2018_01_10
=============================================================================
Updata

*****************************************************************************/
//////////////////////////////////////////////////////////////////////////////
//ヘッダーインクルード
//////////////////////////////////////////////////////////////////////////////
#include "main.h"
#include "weapon.h"
#include "weaponFactory.h"

Weapon * WeaponFactory::create(WEAPON_TYPE type, Dvec3 pos)
{
	switch (type)
	{
	case GOVERMENT:
		return Goverment::create(pos);
	}

	return new NullWeapon;
}
